[
  {
    "year": "To Read (Ordered)",
    "books": [
      {
        "name": "The Catcher In The Rye by: J.D. Salinger"
      },
      {
        "name": "The Knife Of Never Letting Go by: Patrick Ness"
      },
      {
        "name": "The Art Of War by: Sun Tzu"
      }
    ]
  },
  {
    "year": "2025",
    "books": [
      {
        "name": "Zero to One by: Peter Thiel with Blake Masters",
        "review": "Review: An informational novel about innovation and entrepreneurship, emphasizing the value of creating unique businesses rather than copying existing models.",
        "reflection": "Reflection: Interesting concepts, though some parts felt abstract or overly optimistic. Enjoyed the challenge it posed to conventional thinking.",
        "influence": "Influence: Shifted how I think about startups and innovation. Reinforced the idea that breakthroughs in tech and business come from going off the map not just iterating on existing models."
      },
      {
        "name": "1984 by: George Orwell",
        "review": "Review: A dystopian vision of a totalitarian government where surveillance and thought control rule over individual freedom which acts as a warning by Orwell to the future generations.",
        "reflection": "Reflection: Disturbing but brilliant. Really made me reflect on control, freedom, and modern day implications of unchecked authority.",
        "influence": "Influence: Highlighted the ethical concerns surrounding surveillance technology and privacy. It's made me more conscious of how data is used in tech and the responsibility that comes with working in CS."
      },
      {
        "name": "Moneyball by: Michael Lewis",
        "review": "Review: An insightful look into how data and analytics revolutionized baseball, showing that smart thinking can outplay tradition and big budgets.",
        "reflection": "Reflection: A surprising page turner for a sports book. The mix of strategy and human story was captivating.",
        "influence": "Influence: A clear example of how data science and analytics can disrupt even the most tradition bound industries. Reinforced my interest in applying algorithms and data analysis to business problems."
      }
    ]
  },
  {
    "year": "2022",
    "books": [
      {
        "name": "To Kill A Mockingbird by: Harper Lee",
        "review": "Review: A powerful and compassionate story that dives into topics of racism and morality all through the lens of a child in the old American South.",
        "reflection": "Reflection: Touching and eye opening. Scout's innocence gave the heavy themes even more weight.",
        "influence": "Influence: While not directly related to tech, it deepened my appreciation for ethical decision making a crucial mindset when designing tech that affects real lives."
      },
      {
        "name": "Animal Farm by: George Orwell",
        "review": "Review: A story based on an allegory of a farm revolution gone wrong exposing the corruption of power and betrayal of ideals.",
        "reflection": "Reflection: A short read, but incredibly impactful. The ending hit hard and left me thinking for days.",
        "influence": "Influence: Offered a lens into how power structures can evolve, making me reflect on centralized control in large tech platforms and the risks of digital monopolies."
      }
    ]
  },
  {
    "year": "2021",
    "books": [
      {
        "name": "The Marrow Thieves by: Cherie Dimaline",
        "review": "Review: A dystopian story that combines Indigenous resistance, survival, and the battle to protect culture in a world where dreams are being harvested through bone marrow.",
        "reflection": "Reflection: Loved the cultural depth and the emotional stakes. A powerful narrative of resilience.",
        "influence": "Influence: Gave me a deeper awareness of how technology might affect marginalized communities, pushing me to consider inclusivity and ethical impact when thinking about future tech."
      },
      {
        "name": "Silverwing by: Kenneth Oppel",
        "review": "Review: A fantasy novel that follows a young bat's journey of self discovery, danger, and courage while flying the sky.",
        "reflection": "Reflection: Felt adventurous and unique. The animal perspective added a refreshing twist.",
        "influence": "Influence: Sparked early curiosity about perspective taking and non human systems an idea relevant to AI and systems design in CS."
      },
      {
        "name": "Sunwing by: Kenneth Oppel",
        "review": "Review: A thrilling sequel to Silverwing, where bats uncover secrets, face dangerous threats, and fight for survival in a dark and mysterious world.",
        "reflection": "Reflection: Even more action packed than the first. The growing tension and worldbuilding were strong.",
        "influence": "Influence: Reinforced narrative driven thinking useful for game design, interactive tech, and understanding the importance of storytelling in user experience."
      }
    ]
  },
  {
    "year": "2019 and before",
    "books": [
      {
        "name": "Wonder by: R.J. Palacio",
        "review": "Review: A heartwarming and deep story about kindness, empathy, and the power of acceptance, seen through the lens of a young, facely deformed boy.",
        "reflection": "Reflection: Very emotional and inspiring. Really drove home how far empathy can go.",
        "influence": "Influence: Strengthened my belief in designing technology with empathy and accessibility in mind, especially in assistive tech."
      },
      {
        "name": "The Book Thief by: Markus Zusak",
        "review": "Review: An amazingly written, emotional novel narrated by Death, following the life of a young girl in Nazi Germany who finds comfort in stolen books.",
        "reflection": "Reflection: Beautiful and haunting. The narration style made it even more unforgettable.",
        "influence": "Influence: Showed the lasting power of storytelling and information concepts that relate closely to data sharing, digital preservation, and the emotional side of content creation in tech."
      }
    ]
  }
]
